MikroElektronika/core_packages/PIC/XC8/def/PIC18LF8490/mcu.h
#define                                 S7C2_bit            _BIT_ACCESS(LCDDATA12,7)
// LCDDATA18<S7C3>
extern volatile __bit                   S7C3                __at(0x7BBF);	// @ (0xF77 * 8 + 7)
#define                                 S7C3_bit            _BIT_ACCESS(LCDDATA18,7)
// LCDDATA1<S8C0>
extern volatile __bit                   S8C0                __at(0x7B08);	// @ (0xF61 * 8 + 0)
#define                                 S8C0_bit            _BIT_ACCESS(LCDDATA1,0)
// LCDDATA7<S8C1>
extern volatile __bit                   S8C1                __at(0x7B38);	// @ (0xF67 * 8 + 0)
#define                                 S8C1_bit            _BIT_ACCESS(LCDDATA7,0)
// LCDDATA13<S8C2>
extern volatile __bit                   S8C2                __at(0x7B90);	// @ (0xF72 * 8 + 0)
#define                                 S8C2_bit            _BIT_ACCESS(LCDDATA13,0)
// LCDDATA19<S8C3>
extern volatile __bit                   S8C3                __at(0x7BC0);	// @ (0xF78 * 8 + 0)
#define                                 S8C3_bit            _BIT_ACCESS(LCDDATA19,0)
// LCDDATA1<S9C0>
extern volatile __bit                   S9C0                __at(0x7B09);	// @ (0xF61 * 8 + 1)
#define                                 S9C0_bit            _BIT_ACCESS(LCDDATA1,1)
// LCDDATA7<S9C1>
extern volatile __bit                   S9C1                __at(0x7B39);	// @ (0xF67 * 8 + 1)
#define                                 S9C1_bit            _BIT_ACCESS(LCDDATA7,1)
// LCDDATA13<S9C2>
extern volatile __bit                   S9C2                __at(0x7B91);	// @ (0xF72 * 8 + 1)
#define                                 S9C2_bit            _BIT_ACCESS(LCDDATA13,1)
// LCDDATA19<S9C3>
extern volatile __bit                   S9C3                __at(0x7BC1);	// @ (0xF78 * 8 + 1)
#define                                 S9C3_bit            _BIT_ACCESS(LCDDATA19,1)
// RCON<SBOREN>
extern volatile __bit                   SBOREN              __at(0x7E86);	// @ (0xFD0 * 8 + 6)
#define                                 SBOREN_bit          _BIT_ACCESS(RCON,6)
// PORTC<SCK>
extern volatile __bit                   SCK                 __at(0x7C13);	// @ (0xF82 * 8 + 3)
#define                                 SCK_bit             _BIT_ACCESS(PORTC,3)
// BAUDCON1<SCKP>
extern volatile __bit                   SCKP                __at(0x7BF4);	// @ (0xF7E * 8 + 4)
#define                                 SCKP_bit            _BIT_ACCESS(BAUDCON1,4)
// BAUDCON1<SCKP1>
extern volatile __bit                   SCKP1               __at(0x7BF4);	// @ (0xF7E * 8 + 4)
#define                                 SCKP1_bit           _BIT_ACCESS(BAUDCON1,4)
// PORTC<SCL>
extern volatile __bit                   SCL                 __at(0x7C13);	// @ (0xF82 * 8 + 3)
#define                                 SCL_bit             _BIT_ACCESS(PORTC,3)
// OSCCON<SCS0>
extern volatile __bit                   SCS0                __at(0x7E98);	// @ (0xFD3 * 8 + 0)
#define                                 SCS0_bit            _BIT_ACCESS(OSCCON,0)
// OSCCON<SCS1>
extern volatile __bit                   SCS1                __at(0x7E99);	// @ (0xFD3 * 8 + 1)
#define                                 SCS1_bit            _BIT_ACCESS(OSCCON,1)
// PORTC<SDA>
extern volatile __bit                   SDA                 __at(0x7C14);	// @ (0xF82 * 8 + 4)
#define                                 SDA_bit             _BIT_ACCESS(PORTC,4)
// PORTC<SDI>
extern volatile __bit                   SDI                 __at(0x7C14);	// @ (0xF82 * 8 + 4)
#define                                 SDI_bit             _BIT_ACCESS(PORTC,4)
// PORTC<SDO>
extern volatile __bit                   SDO                 __at(0x7C15);	// @ (0xF82 * 8 + 5)
#define                                 SDO_bit             _BIT_ACCESS(PORTC,5)
// LCDSE0<SE0>
extern volatile __bit                   SE0                 __at(0x7AD0);	// @ (0xF5A * 8 + 0)
#define                                 SE0_bit             _BIT_ACCESS(LCDSE0,0)
// LCDSE0<SE1>
extern volatile __bit                   SE1                 __at(0x7AD1);	// @ (0xF5A * 8 + 1)
#define                                 SE1_bit             _BIT_ACCESS(LCDSE0,1)
// LCDSE1<SE10>
extern volatile __bit                   SE10                __at(0x7ADA);	// @ (0xF5B * 8 + 2)
#define                                 SE10_bit            _BIT_ACCESS(LCDSE1,2)
// LCDSE1<SE11>
extern volatile __bit                   SE11                __at(0x7ADB);	// @ (0xF5B * 8 + 3)
#define                                 SE11_bit            _BIT_ACCESS(LCDSE1,3)
// LCDSE1<SE12>
extern volatile __bit                   SE12                __at(0x7ADC);	// @ (0xF5B * 8 + 4)
#define                                 SE12_bit            _BIT_ACCESS(LCDSE1,4)
// LCDSE1<SE13>
extern volatile __bit                   SE13                __at(0x7ADD);	// @ (0xF5B * 8 + 5)
#define                                 SE13_bit            _BIT_ACCESS(LCDSE1,5)
// LCDSE1<SE14>
extern volatile __bit                   SE14                __at(0x7ADE);	// @ (0xF5B * 8 + 6)
#define                                 SE14_bit            _BIT_ACCESS(LCDSE1,6)
// LCDSE1<SE15>
extern volatile __bit                   SE15                __at(0x7ADF);	// @ (0xF5B * 8 + 7)
#define                                 SE15_bit            _BIT_ACCESS(LCDSE1,7)
// LCDSE2<SE16>
extern volatile __bit                   SE16                __at(0x7AE0);	// @ (0xF5C * 8 + 0)
#define                                 SE16_bit            _BIT_ACCESS(LCDSE2,0)
// LCDSE2<SE17>
extern volatile __bit                   SE17                __at(0x7AE1);	// @ (0xF5C * 8 + 1)
#define                                 SE17_bit            _BIT_ACCESS(LCDSE2,1)
// LCDSE2<SE18>
extern volatile __bit                   SE18                __at(0x7AE2);	// @ (0xF5C * 8 + 2)
#define                                 SE18_bit            _BIT_ACCESS(LCDSE2,2)
// LCDSE2<SE19>
extern volatile __bit                   SE19                __at(0x7AE3);	// @ (0xF5C * 8 + 3)
#define                                 SE19_bit            _BIT_ACCESS(LCDSE2,3)
// LCDSE0<SE2>
extern volatile __bit                   SE2                 __at(0x7AD2);	// @ (0xF5A * 8 + 2)
#define                                 SE2_bit             _BIT_ACCESS(LCDSE0,2)
// LCDSE2<SE20>
extern volatile __bit                   SE20                __at(0x7AE4);	// @ (0xF5C * 8 + 4)
#define                                 SE20_bit            _BIT_ACCESS(LCDSE2,4)
// LCDSE2<SE21>
extern volatile __bit                   SE21                __at(0x7AE5);	// @ (0xF5C * 8 + 5)
#define                                 SE21_bit            _BIT_ACCESS(LCDSE2,5)
// LCDSE2<SE22>
extern volatile __bit                   SE22                __at(0x7AE6);	// @ (0xF5C * 8 + 6)
#define                                 SE22_bit            _BIT_ACCESS(LCDSE2,6)
// LCDSE2<SE23>
extern volatile __bit                   SE23                __at(0x7AE7);	// @ (0xF5C * 8 + 7)
#define                                 SE23_bit            _BIT_ACCESS(LCDSE2,7)
// LCDSE3<SE24>
extern volatile __bit                   SE24                __at(0x7AE8);	// @ (0xF5D * 8 + 0)
#define                                 SE24_bit            _BIT_ACCESS(LCDSE3,0)
// LCDSE3<SE25>
extern volatile __bit                   SE25                __at(0x7AE9);	// @ (0xF5D * 8 + 1)
#define                                 SE25_bit            _BIT_ACCESS(LCDSE3,1)
// LCDSE3<SE26>
extern volatile __bit                   SE26                __at(0x7AEA);	// @ (0xF5D * 8 + 2)
#define                                 SE26_bit            _BIT_ACCESS(LCDSE3,2)
// LCDSE3<SE27>
extern volatile __bit                   SE27                __at(0x7AEB);	// @ (0xF5D * 8 + 3)
#define                                 SE27_bit            _BIT_ACCESS(LCDSE3,3)
// LCDSE3<SE28>
extern volatile __bit                   SE28                __at(0x7AEC);	// @ (0xF5D * 8 + 4)
#define                                 SE28_bit            _BIT_ACCESS(LCDSE3,4)
// LCDSE3<SE29>
extern volatile __bit                   SE29                __at(0x7AED);	// @ (0xF5D * 8 + 5)
#define                                 SE29_bit            _BIT_ACCESS(LCDSE3,5)
// LCDSE0<SE3>
extern volatile __bit                   SE3                 __at(0x7AD3);	// @ (0xF5A * 8 + 3)
#define                                 SE3_bit             _BIT_ACCESS(LCDSE0,3)
// LCDSE3<SE30>
extern volatile __bit                   SE30                __at(0x7AEE);	// @ (0xF5D * 8 + 6)
#define                                 SE30_bit            _BIT_ACCESS(LCDSE3,6)
// LCDSE3<SE31>
extern volatile __bit                   SE31                __at(0x7AEF);	// @ (0xF5D * 8 + 7)
#define                                 SE31_bit            _BIT_ACCESS(LCDSE3,7)
// LCDSE4<SE32>
extern volatile __bit                   SE32                __at(0x7AF0);	// @ (0xF5E * 8 + 0)
#define                                 SE32_bit            _BIT_ACCESS(LCDSE4,0)
// LCDSE4<SE33>
extern volatile __bit                   SE33                __at(0x7AF1);	// @ (0xF5E * 8 + 1)
#define                                 SE33_bit            _BIT_ACCESS(LCDSE4,1)
// LCDSE4<SE34>
extern volatile __bit                   SE34                __at(0x7AF2);	// @ (0xF5E * 8 + 2)
#define                                 SE34_bit            _BIT_ACCESS(LCDSE4,2)
// LCDSE4<SE35>
extern volatile __bit                   SE35                __at(0x7AF3);	// @ (0xF5E * 8 + 3)
#define                                 SE35_bit            _BIT_ACCESS(LCDSE4,3)
// LCDSE4<SE36>
extern volatile __bit                   SE36                __at(0x7AF4);	// @ (0xF5E * 8 + 4)
#define                                 SE36_bit            _BIT_ACCESS(LCDSE4,4)
// LCDSE4<SE37>
extern volatile __bit                   SE37                __at(0x7AF5);	// @ (0xF5E * 8 + 5)
#define                                 SE37_bit            _BIT_ACCESS(LCDSE4,5)
// LCDSE4<SE38>
extern volatile __bit                   SE38                __at(0x7AF6);	// @ (0xF5E * 8 + 6)
#define                                 SE38_bit            _BIT_ACCESS(LCDSE4,6)
// LCDSE4<SE39>
extern volatile __bit                   SE39                __at(0x7AF7);	// @ (0xF5E * 8 + 7)
#define                                 SE39_bit            _BIT_ACCESS(LCDSE4,7)
// LCDSE0<SE4>
extern volatile __bit                   SE4                 __at(0x7AD4);	// @ (0xF5A * 8 + 4)
#define                                 SE4_bit             _BIT_ACCESS(LCDSE0,4)
// LCDSE5<SE40>
extern volatile __bit                   SE40                __at(0x7AF8);	// @ (0xF5F * 8 + 0)
#define                                 SE40_bit            _BIT_ACCESS(LCDSE5,0)
// LCDSE5<SE41>
extern volatile __bit                   SE41                __at(0x7AF9);	// @ (0xF5F * 8 + 1)
#define                                 SE41_bit            _BIT_ACCESS(LCDSE5,1)
// LCDSE5<SE42>
extern volatile __bit                   SE42                __at(0x7AFA);	// @ (0xF5F * 8 + 2)
#define                                 SE42_bit            _BIT_ACCESS(LCDSE5,2)
// LCDSE5<SE43>
extern volatile __bit                   SE43                __at(0x7AFB);	// @ (0xF5F * 8 + 3)
#define                                 SE43_bit            _BIT_ACCESS(LCDSE5,3)
// LCDSE5<SE44>
extern volatile __bit                   SE44                __at(0x7AFC);	// @ (0xF5F * 8 + 4)
#define                                 SE44_bit            _BIT_ACCESS(LCDSE5,4)
// LCDSE5<SE45>
extern volatile __bit                   SE45                __at(0x7AFD);	// @ (0xF5F * 8 + 5)
#define                                 SE45_bit            _BIT_ACCESS(LCDSE5,5)
// LCDSE5<SE46>
extern volatile __bit                   SE46                __at(0x7AFE);	// @ (0xF5F * 8 + 6)
#define                                 SE46_bit            _BIT_ACCESS(LCDSE5,6)
// LCDSE5<SE47>
extern volatile __bit                   SE47                __at(0x7AFF);	// @ (0xF5F * 8 + 7)
#define                                 SE47_bit            _BIT_ACCESS(LCDSE5,7)
// LCDSE0<SE5>
extern volatile __bit                   SE5                 __at(0x7AD5);	// @ (0xF5A * 8 + 5)
#define                                 SE5_bit             _BIT_ACCESS(LCDSE0,5)
// LCDSE0<SE6>
extern volatile __bit                   SE6                 __at(0x7AD6);	// @ (0xF5A * 8 + 6)
#define                                 SE6_bit             _BIT_ACCESS(LCDSE0,6)
// LCDSE0<SE7>
extern volatile __bit                   SE7                 __at(0x7AD7);	// @ (0xF5A * 8 + 7)
#define                                 SE7_bit             _BIT_ACCESS(LCDSE0,7)
// LCDSE1<SE8>
extern volatile __bit                   SE8                 __at(0x7AD8);	// @ (0xF5B * 8 + 0)
#define                                 SE8_bit             _BIT_ACCESS(LCDSE1,0)
// LCDSE1<SE9>
extern volatile __bit                   SE9                 __at(0x7AD9);	// @ (0xF5B * 8 + 1)
#define                                 SE9_bit             _BIT_ACCESS(LCDSE1,1)
// PORTD<SEG0>
extern volatile __bit                   SEG0                __at(0x7C18);	// @ (0xF83 * 8 + 0)
#define                                 SEG0_bit            _BIT_ACCESS(PORTD,0)
// LCDDATA0<SEG0COM0>
extern volatile __bit                   SEG0COM0            __at(0x7B00);	// @ (0xF60 * 8 + 0)
#define                                 SEG0COM0_bit        _BIT_ACCESS(LCDDATA0,0)
// LCDDATA6<SEG0COM1>
extern volatile __bit                   SEG0COM1            __at(0x7B30);	// @ (0xF66 * 8 + 0)
#define                                 SEG0COM1_bit        _BIT_ACCESS(LCDDATA6,0)
// LCDDATA12<SEG0COM2>
extern volatile __bit                   SEG0COM2            __at(0x7B88);	// @ (0xF71 * 8 + 0)
#define                                 SEG0COM2_bit        _BIT_ACCESS(LCDDATA12,0)
// LCDDATA18<SEG0COM3>
extern volatile __bit                   SEG0COM3            __at(0x7BB8);	// @ (0xF77 * 8 + 0)
#define                                 SEG0COM3_bit        _BIT_ACCESS(LCDDATA18,0)
// PORTD<SEG1>
extern volatile __bit                   SEG1                __at(0x7C19);	// @ (0xF83 * 8 + 1)
#define                                 SEG1_bit            _BIT_ACCESS(PORTD,1)
// PORTB<SEG10>
extern volatile __bit                   SEG10               __at(0x7C0B);	// @ (0xF81 * 8 + 3)
#define                                 SEG10_bit           _BIT_ACCESS(PORTB,3)
// LCDDATA1<SEG10COM0>
extern volatile __bit                   SEG10COM0           __at(0x7B0A);	// @ (0xF61 * 8 + 2)
#define                                 SEG10COM0_bit       _BIT_ACCESS(LCDDATA1,2)
// LCDDATA7<SEG10COM1>
extern volatile __bit                   SEG10COM1           __at(0x7B3A);	// @ (0xF67 * 8 + 2)
#define                                 SEG10COM1_bit       _BIT_ACCESS(LCDDATA7,2)
// LCDDATA13<SEG10COM2>
extern volatile __bit                   SEG10COM2           __at(0x7B92);	// @ (0xF72 * 8 + 2)
#define                                 SEG10COM2_bit       _BIT_ACCESS(LCDDATA13,2)
// LCDDATA19<SEG10COM3>
extern volatile __bit                   SEG10COM3           __at(0x7BC2);	// @ (0xF78 * 8 + 2)
#define                                 SEG10COM3_bit       _BIT_ACCESS(LCDDATA19,2)
// PORTB<SEG11>
extern volatile __bit                   SEG11               __at(0x7C0C);	// @ (0xF81 * 8 + 4)
#define                                 SEG11_bit           _BIT_ACCESS(PORTB,4)
// LCDDATA1<SEG11COM0>
extern volatile __bit                   SEG11COM0           __at(0x7B0B);	// @ (0xF61 * 8 + 3)
#define                                 SEG11COM0_bit       _BIT_ACCESS(LCDDATA1,3)
// LCDDATA7<SEG11COM1>
extern volatile __bit                   SEG11COM1           __at(0x7B3B);	// @ (0xF67 * 8 + 3)
#define                                 SEG11COM1_bit       _BIT_ACCESS(LCDDATA7,3)
// LCDDATA13<SEG11COM2>
extern volatile __bit                   SEG11COM2           __at(0x7B93);	// @ (0xF72 * 8 + 3)
#define                                 SEG11COM2_bit       _BIT_ACCESS(LCDDATA13,3)
// LCDDATA19<SEG11COM3>
extern volatile __bit                   SEG11COM3           __at(0x7BC3);	// @ (0xF78 * 8 + 3)
#define                                 SEG11COM3_bit       _BIT_ACCESS(LCDDATA19,3)
// PORTC<SEG12>
extern volatile __bit                   SEG12               __at(0x7C13);	// @ (0xF82 * 8 + 3)
#define                                 SEG12_bit           _BIT_ACCESS(PORTC,3)
// LCDDATA1<SEG12COM0>
extern volatile __bit                   SEG12COM0           __at(0x7B0C);	// @ (0xF61 * 8 + 4)
#define                                 SEG12COM0_bit       _BIT_ACCESS(LCDDATA1,4)
// LCDDATA7<SEG12COM1>
extern volatile __bit                   SEG12COM1           __at(0x7B3C);	// @ (0xF67 * 8 + 4)
#define                                 SEG12COM1_bit       _BIT_ACCESS(LCDDATA7,4)
// LCDDATA13<SEG12COM2>
extern volatile __bit                   SEG12COM2           __at(0x7B94);	// @ (0xF72 * 8 + 4)
#define                                 SEG12COM2_bit       _BIT_ACCESS(LCDDATA13,4)
// LCDDATA19<SEG12COM3>
extern volatile __bit                   SEG12COM3           __at(0x7BC4);	// @ (0xF78 * 8 + 4)
#define                                 SEG12COM3_bit       _BIT_ACCESS(LCDDATA19,4)
// PORTC<SEG13>
extern volatile __bit                   SEG13               __at(0x7C12);	// @ (0xF82 * 8 + 2)
#define                                 SEG13_bit           _BIT_ACCESS(PORTC,2)
// LCDDATA1<SEG13COM0>
extern volatile __bit                   SEG13COM0           __at(0x7B0D);	// @ (0xF61 * 8 + 5)
#define                                 SEG13COM0_bit       _BIT_ACCESS(LCDDATA1,5)
// LCDDATA7<SEG13COM1>
extern volatile __bit                   SEG13COM1           __at(0x7B3D);	// @ (0xF67 * 8 + 5)
#define                                 SEG13COM1_bit       _BIT_ACCESS(LCDDATA7,5)
// LCDDATA13<SEG13COM2>
extern volatile __bit                   SEG13COM2           __at(0x7B95);	// @ (0xF72 * 8 + 5)
#define                                 SEG13COM2_bit       _BIT_ACCESS(LCDDATA13,5)
// LCDDATA19<SEG13COM3>
extern volatile __bit                   SEG13COM3           __at(0x7BC5);	// @ (0xF78 * 8 + 5)
#define                                 SEG13COM3_bit       _BIT_ACCESS(LCDDATA19,5)
// PORTA<SEG14>
extern volatile __bit                   SEG14               __at(0x7C04);	// @ (0xF80 * 8 + 4)
#define                                 SEG14_bit           _BIT_ACCESS(PORTA,4)
// LCDDATA1<SEG14COM0>
extern volatile __bit                   SEG14COM0           __at(0x7B0E);	// @ (0xF61 * 8 + 6)
#define                                 SEG14COM0_bit       _BIT_ACCESS(LCDDATA1,6)
// LCDDATA7<SEG14COM1>
extern volatile __bit                   SEG14COM1           __at(0x7B3E);	// @ (0xF67 * 8 + 6)
#define                                 SEG14COM1_bit       _BIT_ACCESS(LCDDATA7,6)
// LCDDATA13<SEG14COM2>
extern volatile __bit                   SEG14COM2           __at(0x7B96);	// @ (0xF72 * 8 + 6)
#define                                 SEG14COM2_bit       _BIT_ACCESS(LCDDATA13,6)
// LCDDATA19<SEG14COM3>
extern volatile __bit                   SEG14COM3           __at(0x7BC6);	// @ (0xF78 * 8 + 6)
#define                                 SEG14COM3_bit       _BIT_ACCESS(LCDDATA19,6)
// PORTA<SEG15>
extern volatile __bit                   SEG15               __at(0x7C05);	// @ (0xF80 * 8 + 5)
#define                                 SEG15_bit           _BIT_ACCESS(PORTA,5)
// LCDDATA1<SEG15COM0>
extern volatile __bit                   SEG15COM0           __at(0x7B0F);	// @ (0xF61 * 8 + 7)
#define                                 SEG15COM0_bit       _BIT_ACCESS(LCDDATA1,7)
// LCDDATA7<SEG15COM1>
extern volatile __bit                   SEG15COM1           __at(0x7B3F);	// @ (0xF67 * 8 + 7)
#define                                 SEG15COM1_bit       _BIT_ACCESS(LCDDATA7,7)
// LCDDATA13<SEG15COM2>
extern volatile __bit                   SEG15COM2           __at(0x7B97);	// @ (0xF72 * 8 + 7)
#define                                 SEG15COM2_bit       _BIT_ACCESS(LCDDATA13,7)
// LCDDATA19<SEG15COM3>
extern volatile __bit                   SEG15COM3           __at(0x7BC7);	// @ (0xF78 * 8 + 7)
#define                                 SEG15COM3_bit       _BIT_ACCESS(LCDDATA19,7)
// PORTA<SEG16>
extern volatile __bit                   SEG16               __at(0x7C02);	// @ (0xF80 * 8 + 2)
#define                                 SEG16_bit           _BIT_ACCESS(PORTA,2)
// LCDDATA2<SEG16COM0>
extern volatile __bit                   SEG16COM0           __at(0x7B10);	// @ (0xF62 * 8 + 0)
#define                                 SEG16COM0_bit       _BIT_ACCESS(LCDDATA2,0)
// LCDDATA8<SEG16COM1>
extern volatile __bit                   SEG16COM1           __at(0x7B40);	// @ (0xF68 * 8 + 0)
#define                                 SEG16COM1_bit       _BIT_ACCESS(LCDDATA8,0)
// LCDDATA14<SEG16COM2>
extern volatile __bit                   SEG16COM2           __at(0x7B98);	// @ (0xF73 * 8 + 0)
#define                                 SEG16COM2_bit       _BIT_ACCESS(LCDDATA14,0)
// LCDDATA20<SEG16COM3>
extern volatile __bit                   SEG16COM3           __at(0x7BC8);	// @ (0xF79 * 8 + 0)
#define                                 SEG16COM3_bit       _BIT_ACCESS(LCDDATA20,0)
// PORTA<SEG17>
extern volatile __bit                   SEG17               __at(0x7C03);	// @ (0xF80 * 8 + 3)
#define                                 SEG17_bit           _BIT_ACCESS(PORTA,3)
// LCDDATA2<SEG17COM0>
extern volatile __bit                   SEG17COM0           __at(0x7B11);	// @ (0xF62 * 8 + 1)
#define                                 SEG17COM0_bit       _BIT_ACCESS(LCDDATA2,1)
// LCDDATA8<SEG17COM1>
extern volatile __bit                   SEG17COM1           __at(0x7B41);	// @ (0xF68 * 8 + 1)
#define                                 SEG17COM1_bit       _BIT_ACCESS(LCDDATA8,1)
// LCDDATA14<SEG17COM2>
extern volatile __bit                   SEG17COM2           __at(0x7B99);	// @ (0xF73 * 8 + 1)
#define                                 SEG17COM2_bit       _BIT_ACCESS(LCDDATA14,1)
// LCDDATA20<SEG17COM3>
extern volatile __bit                   SEG17COM3           __at(0x7BC9);	// @ (0xF79 * 8 + 1)
#define                                 SEG17COM3_bit       _BIT_ACCESS(LCDDATA20,1)
// PORTF<SEG18>
extern volatile __bit                   SEG18               __at(0x7C28);	// @ (0xF85 * 8 + 0)
#define                                 SEG18_bit           _BIT_ACCESS(PORTF,0)
// LCDDATA2<SEG18COM0>
extern volatile __bit                   SEG18COM0           __at(0x7B12);	// @ (0xF62 * 8 + 2)
#define                                 SEG18COM0_bit       _BIT_ACCESS(LCDDATA2,2)
// LCDDATA8<SEG18COM1>
extern volatile __bit                   SEG18COM1           __at(0x7B42);	// @ (0xF68 * 8 + 2)
#define                                 SEG18COM1_bit       _BIT_ACCESS(LCDDATA8,2)
// LCDDATA14<SEG18COM2>
extern volatile __bit                   SEG18COM2           __at(0x7B9A);	// @ (0xF73 * 8 + 2)
#define                                 SEG18COM2_bit       _BIT_ACCESS(LCDDATA14,2)
// LCDDATA20<SEG18COM3>
extern volatile __bit                   SEG18COM3           __at(0x7BCA);	// @ (0xF79 * 8 + 2)
#define                                 SEG18COM3_bit       _BIT_ACCESS(LCDDATA20,2)
// PORTF<SEG19>
extern volatile __bit                   SEG19               __at(0x7C29);	// @ (0xF85 * 8 + 1)
#define                                 SEG19_bit           _BIT_ACCESS(PORTF,1)
// LCDDATA2<SEG19COM0>
extern volatile __bit                   SEG19COM0           __at(0x7B13);	// @ (0xF62 * 8 + 3)
#define                                 SEG19COM0_bit       _BIT_ACCESS(LCDDATA2,3)
// LCDDATA8<SEG19COM1>
extern volatile __bit                   SEG19COM1           __at(0x7B43);	// @ (0xF68 * 8 + 3)
#define                                 SEG19COM1_bit       _BIT_ACCESS(LCDDATA8,3)
// LCDDATA14<SEG19COM2>
extern volatile __bit                   SEG19COM2           __at(0x7B9B);	// @ (0xF73 * 8 + 3)
